{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    h1: \"h1\",\n    blockquote: \"blockquote\",\n    p: \"p\",\n    img: \"img\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.h1, {\n      id: \"frequent-check-ins\",\n      children: \"Frequent Check-ins\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"\\\"Hey, what have you been up to? Are you doing OK?\\\"\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In such a socially distant time, maintaining communication with work teams,\\nfriends and other relationships is vital. As the world pivoted to working from\\nhome, Marketing scholar Michelle is exceptionally grateful to be at a company\\nequipped with the necessary technology resources to make this transition quickly\\nand effectively. Some strategies she has personally undertaken to ensure open\\nand clear communication at work include \\\"Making a conscious effort to discuss\\nwork projects through video call instead of email, which makes a BIG difference\\nto work productivity and also provides social connection!\\\"\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Checking up on your team regularly by scheduling meetings on Google Chat,\\nWhatsapp or other online platforms \\\"daily instead of weekly\\\", as Data Science\\nand Decisions scholar Laurel suggests, reduces the distance we feel navigating\\nlife at home. End of quarter trivia nights on Kahoot, virtual morning coffee\\ncatch-ups or online cards for birthdays are another great way to strengthen a\\nsense of community.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"/img/pubs/checkin.png\",\n        alt: \"Checking in with friends\",\n        width: \"902\",\n        height: \"506\"\n      })\n    }), \"\\n\", _jsx(_components.h1, {\n      id: \"staying-informed-but-not-too-informed\",\n      children: \"Staying Informed But Not Too Informed\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It can be difficult to find the balance between keeping up to date with life,\\nand feeling overwhelmed by the barrage of information conveyed through various\\nmedia outlets. I'm one to immediately click on the most recent news stream, but\\nI've been trying to reduce my intake of all the bleakness, economic and\\npolitical upheaval happening globally as it can take a toll on my mental health.\\nWhilst it is important to maintain an awareness of the current global climate,\\ntaking the time out of my day to \\\"switch off\\\" (badum tss) is much needed too.\"\n    }), \"\\n\", _jsx(_components.h1, {\n      id: \"new-possibilities\",\n      children: \"New Possibilities\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Here at Co-op Soc, our team has risen to the challenge of being exceptionally\\ncreative in hosting online events. As a student society, some activities we've\\nlooked at are online podcasts, movie nights, Spotify music countdowns, game\\nstreamings and challenge events, just to name a few.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"/img/pubs/kahoot.png\",\n        alt: \"Playing Kahoot\",\n        width: \"902\",\n        height: \"676\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The ways in which we traditionally delivered our society goals have been\\ncompletely upturned, but with our engagement levels as high as ever, we're\\nincredibly excited about the endless horizon of new possibilities that have\\nbeen able to be facilitated via Zoom and social media (TikTok in particular, of\\nwhich I have been unashamedly obsessed with lately).\"\n    }), \"\\n\", _jsx(_components.h1, {\n      id: \"contingency-planning\",\n      children: \"Contingency Planning\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Being flexible to change is something the Executive team have been motivated to\\ndo. We have continued working on the key messages, events and actions we want to\\nachieve when this period is over; although, we have been met with numerous\\nchallenges, particularly regarding the supply and production of our new\\nmerchandise. Thus in a time of such change, contingency plans have been helpful\\nin allowing us to adapt quickly when obstacles arise.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Written by 2020 Publications Director Susan Sun\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"frontmatter":{"title":"Social Distancing Without the Socially Distant","image":"/img/pubs/connected.jpg","published":"2020-06-23T00:00:00.000Z","description":"How can we stay connected during isolation?","slug":"social-distance"}},"__N_SSG":true}